Mounith-H/RP2040-NRF24/NRF24.cpp
#include "NRF24.h"
#include "hardware/spi.h"
#include "hardware/gpio.h"
#include <string.h>
#include <stdio.h>
#include "pico/stdlib.h"

// Constructor
NRF24::NRF24(spi_inst_t *spi, uint16_t sck, uint16_t mosi, uint16_t miso, uint16_t csn, uint16_t ce, uint16_t irq)
{
    this->spi = spi;
    this->sck = sck;
    this->mosi = mosi;
    this->miso = miso;
    this->csn = csn;
    this->ce = ce;
    this->irq = irq;
    
    // Initialize default values
    this->status = 0;
    this->fifo_status = 0;
    this->payload_size = 32;
    this->address_width = 5;
    this->channel = 2;
    this->tx_power = NRF24_POWER_LEVEL_0DBM;
    this->data_rate = NRF24_DATA_RATE_1MBPS;
    this->crc_length = NRF24_CRC_16BIT;
    this->auto_retransmit_count = 3;
    this->auto_retransmit_delay = NRF24_ARD_250US;
    this->dynamic_payload_enabled = false;
    this->auto_ack_enabled = true;
    this->is_plus_variant = false;
    this->rx_pipe_enabled = 0;
    
    // Initialize statistics
    this->packets_lost = 0;
    this->packets_sent = 0;
    this->packets_received = 0;
    this->retransmit_count = 0;
    
    // Initialize pipe configurations
    for (int i = 0; i < NRF_MAX_PIPES; i++) {
        memset(pipes[i].address, 0, NRF_MAX_ADDR_SIZE);
        pipes[i].address_width = 5;
        pipes[i].payload_size = 32;
        pipes[i].auto_ack_enabled = true;
        pipes[i].dynamic_payload_enabled = false;
    }
    
    // Initialize default TX address
    memset(tx_address, 0, NRF_MAX_ADDR_SIZE);
}

// Destructor
NRF24::~NRF24()
{
    powerDown();
}

// Initialize the NRF24L01 module
bool NRF24::begin()
{
    // Initialize SPI
    spi_init(this->spi, 4000000); // Start with 4MHz for initialization
    gpio_set_function(sck, GPIO_FUNC_SPI);
    gpio_set_function(miso, GPIO_FUNC_SPI);
    gpio_set_function(mosi, GPIO_FUNC_SPI);
    
    // Initialize control pins
    gpio_init(csn);
    gpio_init(ce);
    gpio_set_dir(csn, GPIO_OUT);
    gpio_set_dir(ce, GPIO_OUT);
    
    // Initialize IRQ pin if specified
    if (irq != 0xFF) {
        gpio_init(irq);
        gpio_set_dir(irq, GPIO_IN);
        gpio_pull_up(irq);
    }
    
    // Set initial pin states
    ceLow();
    csnHigh();
    
    // Wait for chip to stabilize
    sleep_ms(5);
    
    // Check if chip is connected
    if (!isChipConnected()) {
        return false;
    }
    
    // Reset to known state
    reset();
    
    // Detect if this is a + variant
    uint8_t setup = readReg(NRF_RF_SETUP_REGISTER);
    writeReg(NRF_RF_SETUP_REGISTER, setup | 0x80);
    if (readReg(NRF_RF_SETUP_REGISTER) & 0x80) {
        is_plus_variant = true;
        writeReg(NRF_RF_SETUP_REGISTER, setup); // Restore original value
    }
    
    // Enable features for + variant
    if (is_plus_variant) {
        activateFeatures();
    }
    
    // Increase SPI speed after successful initialization
    spi_set_baudrate(this->spi, 8000000); // 8MHz for normal operation
    
    return true;
}

// Check if the chip is connected and responding
bool NRF24::isConnected()
{
    return isChipConnected();
}

// Reset the NRF24L01 to default state
void NRF24::reset()
{
    // Power down
    powerDown();
    sleep_ms(2);
    
    // Reset all registers to default values
    writeReg(NRF_CONFIG_REGISTER, 0x08);
    writeReg(NRF_EN_AA_REGISTER, 0x3F);
    writeReg(NRF_EN_RXADDR_REGISTER, 0x03);
    writeReg(NRF_SETUP_AW_REGISTER, 0x03);
    writeReg(NRF_SETUP_RETR_REGISTER, 0x03);
    writeReg(NRF_RF_CH_REGISTER, 0x02);
    writeReg(NRF_RF_SETUP_REGISTER, 0x0E);
    writeReg(NRF_STATUS_REGISTER, 0x70);
    
    // Clear FIFOs
    flushTx();
    flushRx();
    
    // Clear interrupts
    clearInterrupts();
    
    // Set default addresses
    uint8_t addr_p0_p1_default[] = {0xE7, 0xE7, 0xE7, 0xE7, 0xE7};
    uint8_t addr_p2_default = 0xC2;
    uint8_t addr_p3_default = 0xC3;
    uint8_t addr_p4_default = 0xC4;
    uint8_t addr_p5_default = 0xC5;
    
    writeReg(NRF_RX_ADDR_P0_REGISTER, addr_p0_p1_default, 5);
    writeReg(NRF_RX_ADDR_P1_REGISTER, addr_p0_p1_default, 5);
    writeReg(NRF_RX_ADDR_P2_REGISTER, addr_p2_default);
    writeReg(NRF_RX_ADDR_P3_REGISTER, addr_p3_default);
    writeReg(NRF_RX_ADDR_P4_REGISTER, addr_p4_default);
    writeReg(NRF_RX_ADDR_P5_REGISTER, addr_p5_default);
    writeReg(NRF_TX_ADDR_REGISTER, addr_p0_p1_default, 5);
    
    // Set default payload sizes
    writeReg(NRF_RX_PW_P0_REGISTER, 0x20);
    writeReg(NRF_RX_PW_P1_REGISTER, 0x20);
    writeReg(NRF_RX_PW_P2_REGISTER, 0x20);
    writeReg(NRF_RX_PW_P3_REGISTER, 0x20);
    writeReg(NRF_RX_PW_P4_REGISTER, 0x20);
    writeReg(NRF_RX_PW_P5_REGISTER, 0x20);
    
    // Reset feature register
    writeReg(NRF_FEATURE_REGISTER, 0x00);
    writeReg(NRF_DYNPD_REGISTER, 0x00);
    
    // Update internal state
    payload_size = 32;
    address_width = 5;
    channel = 2;
    dynamic_payload_enabled = false;
    auto_ack_enabled = true;
    rx_pipe_enabled = 0x03; // Pipe 0 and 1 enabled by default
}

// Low-level register operations
uint8_t NRF24::readReg(uint8_t reg)
{
    reg = NRF_R_REGISTER | (reg & 0x1F);
    uint8_t result = 0;
    csnLow();
    spi_write_blocking(spi, &reg, 1);
    spi_read_blocking(spi, 0x00, &result, 1);
    csnHigh();
    return result;
}

void NRF24::writeReg(uint8_t reg, uint8_t data)
{
    writeReg(reg, &data, 1);
}

void NRF24::writeReg(uint8_t reg, uint8_t *data, uint8_t size)
{
    reg = NRF_W_REGISTER | (reg & 0x1F);
    csnLow();
    spi_write_blocking(spi, &reg, 1);
    spi_write_blocking(spi, data, size);
    csnHigh();
}

void NRF24::writeCommand(uint8_t cmd)
{
    csnLow();
    spi_write_blocking(spi, &cmd, 1);
    csnHigh();
}

uint8_t NRF24::sendCommand(uint8_t cmd)
{
    uint8_t status = 0;
    csnLow();
    spi_write_read_blocking(spi, &cmd, &status, 1);
    csnHigh();
    return status;
}

// Internal utility functions
void NRF24::flushTx()
{
    writeCommand(NRF_FLUSH_TX);
}

void NRF24::flushRx()
{
    writeCommand(NRF_FLUSH_RX);
}

void NRF24::clearInterrupts()
{
    writeReg(NRF_STATUS_REGISTER, NRF_STATUS_RX_DR | NRF_STATUS_TX_DS | NRF_STATUS_MAX_RT);
}

void NRF24::updateStatus()
{
    status = readReg(NRF_STATUS_REGISTER);
    fifo_status = readReg(NRF_FIFO_STATUS_REGISTER);
}

void NRF24::powerUp()
{
    uint8_t config = readReg(NRF_CONFIG_REGISTER);
    config |= NRF_CONFIG_PWR_UP;
    writeReg(NRF_CONFIG_REGISTER, config);
    sleep_us(1500); // Wait for power up
}

void NRF24::powerDown()
{
    uint8_t config = readReg(NRF_CONFIG_REGISTER);
    config &= ~NRF_CONFIG_PWR_UP;
    writeReg(NRF_CONFIG_REGISTER, config);
}

void NRF24::activateFeatures()
{
    uint8_t activate_cmd = 0x50;
    uint8_t activate_data = 0x73;
    csnLow();
    spi_write_blocking(spi, &activate_cmd, 1);
    spi_write_blocking(spi, &activate_data, 1);
    csnHigh();
}

bool NRF24::isChipConnected()
{
    uint8_t setup_aw = readReg(NRF_SETUP_AW_REGISTER);
    return (setup_aw & 0x0C) == 0x00 && (setup_aw & 0x03) != 0x00;
}

void NRF24::setRegisterBit(uint8_t reg, uint8_t bit, bool value)
{
    uint8_t reg_val = readReg(reg);
    if (value) {
        reg_val |= (1 << bit);
    } else {
        reg_val &= ~(1 << bit);
    }
    writeReg(reg, reg_val);
}

bool NRF24::getRegisterBit(uint8_t reg, uint8_t bit)
{
    uint8_t reg_val = readReg(reg);
    return (reg_val & (1 << bit)) != 0;
}

