Mounith-H/RP2040-NRF24/NRF24.cpp
// Power management
void NRF24::setPowerUp(bool power_up)
{
    if (power_up) {
        powerUp();
    } else {
        powerDown();
    }
}

bool NRF24::isPoweredUp()
{
    return getRegisterBit(NRF_CONFIG_REGISTER, 1);
}

// Mode switching
void NRF24::setModeRX()
{
    ceLow();
    setRegisterBit(NRF_CONFIG_REGISTER, 0, true); // Set PRIM_RX
    powerUp();
    ceHigh();
    sleep_us(130); // RX settling time
}

void NRF24::setModeTX()
{
    ceLow();
    setRegisterBit(NRF_CONFIG_REGISTER, 0, false); // Clear PRIM_RX
    powerUp();
    sleep_us(130); // TX settling time
}

void NRF24::setModeStandby()
{
    ceLow();
    powerUp();
}

bool NRF24::isModeTX()
{
    return !getRegisterBit(NRF_CONFIG_REGISTER, 0);
}

bool NRF24::isModeRX()
{
    return getRegisterBit(NRF_CONFIG_REGISTER, 0);
}

// Channel and frequency configuration
void NRF24::setChannel(uint8_t channel)
{
    if (channel > NRF_MAX_CHANNEL) {
        channel = NRF_MAX_CHANNEL;
    }
    this->channel = channel;
    writeReg(NRF_RF_CH_REGISTER, channel);
}

uint8_t NRF24::getChannel()
{
    return readReg(NRF_RF_CH_REGISTER);
}

void NRF24::setFrequency(uint16_t frequency_mhz)
{
    if (frequency_mhz < 2400 || frequency_mhz > 2525) {
        return; // Invalid frequency
    }
    uint8_t channel = frequency_mhz - 2400;
    setChannel(channel);
}

uint16_t NRF24::getFrequency()
{
    return 2400 + getChannel();
}

// Data rate configuration
void NRF24::setDataRate(NRF24_DataRate rate)
{
    uint8_t rf_setup = readReg(NRF_RF_SETUP_REGISTER);
    
    // Clear existing data rate bits
    rf_setup &= ~(NRF_RF_SETUP_RF_DR_LOW | NRF_RF_SETUP_RF_DR_HIGH);
    
    switch (rate) {
        case NRF24_DATA_RATE_250KBPS:
            rf_setup |= NRF_RF_SETUP_RF_DR_LOW;
            break;
        case NRF24_DATA_RATE_1MBPS:
            // Both bits clear for 1Mbps
            break;
        case NRF24_DATA_RATE_2MBPS:
            rf_setup |= NRF_RF_SETUP_RF_DR_HIGH;
            break;
    }
    
    writeReg(NRF_RF_SETUP_REGISTER, rf_setup);
    this->data_rate = rate;
}

NRF24_DataRate NRF24::getDataRate()
{
    uint8_t rf_setup = readReg(NRF_RF_SETUP_REGISTER);
    
    if (rf_setup & NRF_RF_SETUP_RF_DR_LOW) {
        return NRF24_DATA_RATE_250KBPS;
    } else if (rf_setup & NRF_RF_SETUP_RF_DR_HIGH) {
        return NRF24_DATA_RATE_2MBPS;
    } else {
        return NRF24_DATA_RATE_1MBPS;
    }
}

// Power level configuration
void NRF24::setPowerLevel(NRF24_PowerLevel level)
{
    uint8_t rf_setup = readReg(NRF_RF_SETUP_REGISTER);
    rf_setup &= ~NRF_RF_SETUP_RF_PWR; // Clear power bits
    rf_setup |= (level << 1); // Set new power level
    writeReg(NRF_RF_SETUP_REGISTER, rf_setup);
    this->tx_power = level;
}

NRF24_PowerLevel NRF24::getPowerLevel()
{
    uint8_t rf_setup = readReg(NRF_RF_SETUP_REGISTER);
    return (NRF24_PowerLevel)((rf_setup & NRF_RF_SETUP_RF_PWR) >> 1);
}

// CRC configuration
void NRF24::setCRCLength(NRF24_CRCLength length)
{
    uint8_t config = readReg(NRF_CONFIG_REGISTER);
    
    switch (length) {
        case NRF24_CRC_DISABLED:
            config &= ~NRF_CONFIG_EN_CRC;
            break;
        case NRF24_CRC_8BIT:
            config |= NRF_CONFIG_EN_CRC;
            config &= ~NRF_CONFIG_CRCO;
            break;
        case NRF24_CRC_16BIT:
            config |= NRF_CONFIG_EN_CRC;
            config |= NRF_CONFIG_CRCO;
            break;
    }
    
    writeReg(NRF_CONFIG_REGISTER, config);
    this->crc_length = length;
}

NRF24_CRCLength NRF24::getCRCLength()
{
    uint8_t config = readReg(NRF_CONFIG_REGISTER);
    
    if (!(config & NRF_CONFIG_EN_CRC)) {
        return NRF24_CRC_DISABLED;
    } else if (config & NRF_CONFIG_CRCO) {
        return NRF24_CRC_16BIT;
    } else {
        return NRF24_CRC_8BIT;
    }
}

// Address configuration
void NRF24::setAddressWidth(NRF24_AddressWidth width)
{
    uint8_t aw = width + 1; // Convert to register value (2-4)
    writeReg(NRF_SETUP_AW_REGISTER, aw);
    this->address_width = width + 2; // Convert to actual width (3-5)
}

NRF24_AddressWidth NRF24::getAddressWidth()
{
    uint8_t aw = readReg(NRF_SETUP_AW_REGISTER);
    return (NRF24_AddressWidth)(aw - 1);
}

void NRF24::setTxAddress(uint8_t *address)
{
    writeReg(NRF_TX_ADDR_REGISTER, address, address_width);
    writeReg(NRF_RX_ADDR_P0_REGISTER, address, address_width); // For auto-ack
    memcpy(tx_address, address, address_width);
}

void NRF24::getTxAddress(uint8_t *address)
{
    memcpy(address, tx_address, address_width);
}

// Pipe configuration
void NRF24::openReadingPipe(uint8_t pipe, uint8_t *address)
{
    if (pipe >= NRF_MAX_PIPES) return;
    
    // Enable the pipe
    uint8_t en_rxaddr = readReg(NRF_EN_RXADDR_REGISTER);
    en_rxaddr |= (1 << pipe);
    writeReg(NRF_EN_RXADDR_REGISTER, en_rxaddr);
    
    // Set address
    if (pipe <= 1) {
        writeReg(NRF_RX_ADDR_P0_REGISTER + pipe, address, address_width);
    } else {
        writeReg(NRF_RX_ADDR_P0_REGISTER + pipe, address[address_width - 1]);
    }
    
    // Set payload size
    writeReg(NRF_RX_PW_P0_REGISTER + pipe, payload_size);
    
    // Update internal state
    memcpy(pipes[pipe].address, address, address_width);
    pipes[pipe].address_width = address_width;
    pipes[pipe].payload_size = payload_size;
    rx_pipe_enabled |= (1 << pipe);
}

void NRF24::openWritingPipe(uint8_t *address)
{
    setTxAddress(address);
}

void NRF24::closePipe(uint8_t pipe)
{
    if (pipe >= NRF_MAX_PIPES) return;
    
    uint8_t en_rxaddr = readReg(NRF_EN_RXADDR_REGISTER);
    en_rxaddr &= ~(1 << pipe);
    writeReg(NRF_EN_RXADDR_REGISTER, en_rxaddr);
    
    rx_pipe_enabled &= ~(1 << pipe);
}

void NRF24::setPayloadSize(uint8_t size)
{
    if (size > NRF_MAX_PAYLOAD_SIZE) size = NRF_MAX_PAYLOAD_SIZE;
    this->payload_size = size;
    this->messageLen = size; // For compatibility
    
    // Update all enabled pipes
    for (uint8_t i = 0; i < NRF_MAX_PIPES; i++) {
        if (rx_pipe_enabled & (1 << i)) {
            writeReg(NRF_RX_PW_P0_REGISTER + i, size);
            pipes[i].payload_size = size;
        }
    }
}

void NRF24::setPayloadSize(uint8_t pipe, uint8_t size)
{
    if (pipe >= NRF_MAX_PIPES || size > NRF_MAX_PAYLOAD_SIZE) return;
    
    writeReg(NRF_RX_PW_P0_REGISTER + pipe, size);
    pipes[pipe].payload_size = size;
}

uint8_t NRF24::getPayloadSize()
{
    return payload_size;
}

