Mounith-H/RP2040-NRF24/NRF24.cpp
uint8_t NRF24::getPayloadSize(uint8_t pipe)
{
    if (pipe >= NRF_MAX_PIPES) return 0;
    return pipes[pipe].payload_size;
}

// Auto-acknowledgment
void NRF24::setAutoAck(bool enable)
{
    if (enable) {
        writeReg(NRF_EN_AA_REGISTER, 0x3F); // Enable for all pipes
    } else {
        writeReg(NRF_EN_AA_REGISTER, 0x00); // Disable for all pipes
    }
    this->auto_ack_enabled = enable;
}

void NRF24::setAutoAck(uint8_t pipe, bool enable)
{
    if (pipe >= NRF_MAX_PIPES) return;
    
    uint8_t en_aa = readReg(NRF_EN_AA_REGISTER);
    if (enable) {
        en_aa |= (1 << pipe);
    } else {
        en_aa &= ~(1 << pipe);
    }
    writeReg(NRF_EN_AA_REGISTER, en_aa);
    pipes[pipe].auto_ack_enabled = enable;
}

bool NRF24::isAutoAckEnabled()
{
    return auto_ack_enabled;
}

bool NRF24::isAutoAckEnabled(uint8_t pipe)
{
    if (pipe >= NRF_MAX_PIPES) return false;
    return pipes[pipe].auto_ack_enabled;
}

// Auto-retransmit configuration
void NRF24::setRetries(uint8_t delay, uint8_t count)
{
    if (delay > 15) delay = 15;
    if (count > 15) count = 15;
    
    uint8_t setup_retr = (delay << 4) | count;
    writeReg(NRF_SETUP_RETR_REGISTER, setup_retr);
    
    this->auto_retransmit_delay = (NRF24_AutoRetransmitDelay)delay;
    this->auto_retransmit_count = count;
}

void NRF24::setRetryDelay(NRF24_AutoRetransmitDelay delay)
{
    uint8_t setup_retr = readReg(NRF_SETUP_RETR_REGISTER);
    setup_retr = (setup_retr & 0x0F) | (delay << 4);
    writeReg(NRF_SETUP_RETR_REGISTER, setup_retr);
    this->auto_retransmit_delay = delay;
}

void NRF24::setRetryCount(uint8_t count)
{
    if (count > 15) count = 15;
    uint8_t setup_retr = readReg(NRF_SETUP_RETR_REGISTER);
    setup_retr = (setup_retr & 0xF0) | count;
    writeReg(NRF_SETUP_RETR_REGISTER, setup_retr);
    this->auto_retransmit_count = count;
}

uint8_t NRF24::getRetryCount()
{
    return readReg(NRF_SETUP_RETR_REGISTER) & 0x0F;
}

NRF24_AutoRetransmitDelay NRF24::getRetryDelay()
{
    return (NRF24_AutoRetransmitDelay)((readReg(NRF_SETUP_RETR_REGISTER) & 0xF0) >> 4);
}

// Dynamic payload
void NRF24::enableDynamicPayloads()
{
    writeReg(NRF_FEATURE_REGISTER, readReg(NRF_FEATURE_REGISTER) | NRF_FEATURE_EN_DPL);
    writeReg(NRF_DYNPD_REGISTER, 0x3F); // Enable for all pipes
    this->dynamic_payload_enabled = true;
}

void NRF24::disableDynamicPayloads()
{
    writeReg(NRF_FEATURE_REGISTER, readReg(NRF_FEATURE_REGISTER) & ~NRF_FEATURE_EN_DPL);
    writeReg(NRF_DYNPD_REGISTER, 0x00); // Disable for all pipes
    this->dynamic_payload_enabled = false;
}

void NRF24::enableDynamicPayload(uint8_t pipe)
{
    if (pipe >= NRF_MAX_PIPES) return;
    
    writeReg(NRF_FEATURE_REGISTER, readReg(NRF_FEATURE_REGISTER) | NRF_FEATURE_EN_DPL);
    writeReg(NRF_DYNPD_REGISTER, readReg(NRF_DYNPD_REGISTER) | (1 << pipe));
    pipes[pipe].dynamic_payload_enabled = true;
}

void NRF24::disableDynamicPayload(uint8_t pipe)
{
    if (pipe >= NRF_MAX_PIPES) return;
    
    writeReg(NRF_DYNPD_REGISTER, readReg(NRF_DYNPD_REGISTER) & ~(1 << pipe));
    pipes[pipe].dynamic_payload_enabled = false;
}

bool NRF24::isDynamicPayloadEnabled()
{
    return dynamic_payload_enabled;
}

bool NRF24::isDynamicPayloadEnabled(uint8_t pipe)
{
    if (pipe >= NRF_MAX_PIPES) return false;
    return pipes[pipe].dynamic_payload_enabled;
}

// Payload with ACK
void NRF24::enableAckPayload()
{
    writeReg(NRF_FEATURE_REGISTER, readReg(NRF_FEATURE_REGISTER) | NRF_FEATURE_EN_ACK_PAY | NRF_FEATURE_EN_DPL);
    writeReg(NRF_DYNPD_REGISTER, readReg(NRF_DYNPD_REGISTER) | 0x01); // Enable for pipe 0
}

void NRF24::disableAckPayload()
{
    writeReg(NRF_FEATURE_REGISTER, readReg(NRF_FEATURE_REGISTER) & ~NRF_FEATURE_EN_ACK_PAY);
}

void NRF24::writeAckPayload(uint8_t pipe, uint8_t *data, uint8_t len)
{
    if (pipe >= NRF_MAX_PIPES || len > NRF_MAX_PAYLOAD_SIZE) return;
    
    uint8_t cmd = NRF_W_ACK_PAYLOAD | pipe;
    csnLow();
    spi_write_blocking(spi, &cmd, 1);
    spi_write_blocking(spi, data, len);
    csnHigh();
}

// Data transmission
bool NRF24::write(uint8_t *data, uint8_t len)
{
    return write(data, len, false);
}

bool NRF24::write(uint8_t *data, uint8_t len, bool multicast)
{
    if (len > NRF_MAX_PAYLOAD_SIZE) return false;
    
    // Switch to TX mode
    setModeTX();
    
    // Clear previous interrupts
    clearInterrupts();
    
    // Write payload
    uint8_t cmd = multicast ? NRF_W_TX_PAYLOAD_NO_ACK : NRF_W_TX_PAYLOAD;
    csnLow();
    spi_write_blocking(spi, &cmd, 1);
    spi_write_blocking(spi, data, len);
    csnHigh();
    
    // Start transmission
    ceHigh();
    sleep_us(15); // Minimum pulse width
    ceLow();
    
    // Wait for transmission to complete
    uint32_t timeout = 0;
    while (!(readReg(NRF_STATUS_REGISTER) & (NRF_STATUS_TX_DS | NRF_STATUS_MAX_RT))) {
        sleep_us(1);
        if (++timeout > 10000) { // 10ms timeout
            flushTx();
            return false;
        }
    }
    
    uint8_t status = readReg(NRF_STATUS_REGISTER);
    bool result = (status & NRF_STATUS_TX_DS) != 0;
    
    // Clear interrupts
    clearInterrupts();
    
    // Update statistics
    if (result) {
        packets_sent++;
    } else {
        packets_lost++;
    }
    
    return result;
}

void NRF24::startWrite(uint8_t *data, uint8_t len)
{
    startWrite(data, len, false);
}

void NRF24::startWrite(uint8_t *data, uint8_t len, bool multicast)
{
    if (len > NRF_MAX_PAYLOAD_SIZE) return;
    
    // Switch to TX mode
    setModeTX();
    
    // Clear previous interrupts
    clearInterrupts();
    
    // Write payload
    uint8_t cmd = multicast ? NRF_W_TX_PAYLOAD_NO_ACK : NRF_W_TX_PAYLOAD;
    csnLow();
    spi_write_blocking(spi, &cmd, 1);
    spi_write_blocking(spi, data, len);
    csnHigh();
    
    // Start transmission
    ceHigh();
    sleep_us(15); // Minimum pulse width
    ceLow();
}

bool NRF24::writeBlocking(uint8_t *data, uint8_t len, uint32_t timeout_ms)
{
    startWrite(data, len);
    
    uint32_t start_time = to_ms_since_boot(get_absolute_time());
    uint32_t current_time = start_time;
    
