Mounith-H/RP2040-NRF24/NRF24.cpp
    while (current_time - start_time < timeout_ms) {
        uint8_t status = readReg(NRF_STATUS_REGISTER);
        if (status & (NRF_STATUS_TX_DS | NRF_STATUS_MAX_RT)) {
            bool result = (status & NRF_STATUS_TX_DS) != 0;
            clearInterrupts();
            
            if (result) {
                packets_sent++;
            } else {
                packets_lost++;
            }
            
            return result;
        }
        sleep_us(10);
        current_time = to_ms_since_boot(get_absolute_time());
    }
    
    // Timeout occurred
    flushTx();
    return false;
}

// Data reception
bool NRF24::available()
{
    uint8_t pipe_num;
    return available(&pipe_num);
}

bool NRF24::available(uint8_t *pipe_num)
{
    uint8_t status = readReg(NRF_STATUS_REGISTER);
    
    if (status & NRF_STATUS_RX_DR) {
        *pipe_num = (status & NRF_STATUS_RX_P_NO) >> 1;
        return true;
    }
    
    return false;
}

uint8_t NRF24::read(uint8_t *data, uint8_t len)
{
    uint8_t payload_len = len;
    
    if (dynamic_payload_enabled) {
        payload_len = getDynamicPayloadSize();
        if (payload_len > len) payload_len = len;
    }
    
    csnLow();
    uint8_t cmd = NRF_R_RX_PAYLOAD;
    spi_write_blocking(spi, &cmd, 1);
    spi_read_blocking(spi, 0x00, data, payload_len);
    csnHigh();
    
    // Clear RX interrupt
    writeReg(NRF_STATUS_REGISTER, NRF_STATUS_RX_DR);
    
    packets_received++;
    return payload_len;
}

uint8_t NRF24::getDynamicPayloadSize()
{
    uint8_t result = 0;
    csnLow();
    uint8_t cmd = NRF_R_RX_PL_WID;
    spi_write_blocking(spi, &cmd, 1);
    spi_read_blocking(spi, 0x00, &result, 1);
    csnHigh();
    
    if (result > NRF_MAX_PAYLOAD_SIZE) {
        flushRx();
        return 0;
    }
    
    return result;
}

void NRF24::startListening()
{
    setModeRX();
}

void NRF24::stopListening()
{
    ceLow();
    if (readReg(NRF_FEATURE_REGISTER) & NRF_FEATURE_EN_ACK_PAY) {
        sleep_us(130);
    }
}

// Status and diagnostics
uint8_t NRF24::getStatus()
{
    return readReg(NRF_STATUS_REGISTER);
}

bool NRF24::testCarrier()
{
    return readReg(NRF_RPD_REGISTER) & 0x01;
}

bool NRF24::testRPD()
{
    return testCarrier();
}

uint8_t NRF24::getObserveTx()
{
    return readReg(NRF_OBSERVE_TX_REGISTER);
}

uint8_t NRF24::getLostPackets()
{
    return (readReg(NRF_OBSERVE_TX_REGISTER) & 0xF0) >> 4;
}

uint8_t NRF24::getRetransmitCount()
{
    return readReg(NRF_OBSERVE_TX_REGISTER) & 0x0F;
}

void NRF24::resetPacketLossCounters()
{
    writeReg(NRF_RF_CH_REGISTER, channel); // Reset by writing to channel register
}

// Interrupt handling
void NRF24::maskInterrupt(uint8_t interrupt)
{
    uint8_t config = readReg(NRF_CONFIG_REGISTER);
    config |= interrupt;
    writeReg(NRF_CONFIG_REGISTER, config);
}

void NRF24::unmaskInterrupt(uint8_t interrupt)
{
    uint8_t config = readReg(NRF_CONFIG_REGISTER);
    config &= ~interrupt;
    writeReg(NRF_CONFIG_REGISTER, config);
}

bool NRF24::isInterruptTriggered(uint8_t interrupt)
{
    return (readReg(NRF_STATUS_REGISTER) & interrupt) != 0;
}

void NRF24::clearInterrupt(uint8_t interrupt)
{
    writeReg(NRF_STATUS_REGISTER, interrupt);
}

// FIFO operations
bool NRF24::isTxFifoEmpty()
{
    return readReg(NRF_FIFO_STATUS_REGISTER) & NRF_FIFO_STATUS_TX_EMPTY;
}

bool NRF24::isTxFifoFull()
{
    return readReg(NRF_FIFO_STATUS_REGISTER) & NRF_FIFO_STATUS_TX_FULL;
}

bool NRF24::isRxFifoEmpty()
{
    return readReg(NRF_FIFO_STATUS_REGISTER) & NRF_FIFO_STATUS_RX_EMPTY;
}

bool NRF24::isRxFifoFull()
{
    return readReg(NRF_FIFO_STATUS_REGISTER) & NRF_FIFO_STATUS_RX_FULL;
}

void NRF24::flushTxFifo()
{
    flushTx();
}

void NRF24::flushRxFifo()
{
    flushRx();
}

// Advanced features
void NRF24::setCarrierWave(bool enable)
{
    uint8_t rf_setup = readReg(NRF_RF_SETUP_REGISTER);
    if (enable) {
        rf_setup |= NRF_RF_SETUP_CONT_WAVE;
    } else {
        rf_setup &= ~NRF_RF_SETUP_CONT_WAVE;
    }
    writeReg(NRF_RF_SETUP_REGISTER, rf_setup);
}

bool NRF24::isCarrierWave()
{
    return (readReg(NRF_RF_SETUP_REGISTER) & NRF_RF_SETUP_CONT_WAVE) != 0;
}

void NRF24::enterTestMode()
{
    setCarrierWave(true);
    setModeTX();
    ceHigh();
}

void NRF24::exitTestMode()
{
    ceLow();
    setCarrierWave(false);
}

// Statistics
uint16_t NRF24::getPacketsSent()
{
    return packets_sent;
}

uint16_t NRF24::getPacketsReceived()
{
    return packets_received;
}

uint16_t NRF24::getPacketsLost()
{
    return packets_lost;
}

void NRF24::resetStatistics()
{
    packets_sent = 0;
    packets_received = 0;
    packets_lost = 0;
    retransmit_count = 0;
}

// Print detailed information about the module
void NRF24::printDetails()
{
    printf("NRF24L01%s Details:\n", is_plus_variant ? "+" : "");
    printf("STATUS: 0x%02X\n", readReg(NRF_STATUS_REGISTER));
    printf("CONFIG: 0x%02X\n", readReg(NRF_CONFIG_REGISTER));
    printf("EN_AA: 0x%02X\n", readReg(NRF_EN_AA_REGISTER));
    printf("EN_RXADDR: 0x%02X\n", readReg(NRF_EN_RXADDR_REGISTER));
    printf("SETUP_AW: 0x%02X\n", readReg(NRF_SETUP_AW_REGISTER));
    printf("SETUP_RETR: 0x%02X\n", readReg(NRF_SETUP_RETR_REGISTER));
    printf("RF_CH: %d\n", readReg(NRF_RF_CH_REGISTER));
    printf("RF_SETUP: 0x%02X\n", readReg(NRF_RF_SETUP_REGISTER));
    printf("OBSERVE_TX: 0x%02X\n", readReg(NRF_OBSERVE_TX_REGISTER));
    printf("FIFO_STATUS: 0x%02X\n", readReg(NRF_FIFO_STATUS_REGISTER));
    printf("DYNPD: 0x%02X\n", readReg(NRF_DYNPD_REGISTER));
    printf("FEATURE: 0x%02X\n", readReg(NRF_FEATURE_REGISTER));
    
    printf("\nData Rate: ");
    switch (getDataRate()) {
        case NRF24_DATA_RATE_250KBPS: printf("250kbps"); break;
        case NRF24_DATA_RATE_1MBPS: printf("1Mbps"); break;
        case NRF24_DATA_RATE_2MBPS: printf("2Mbps"); break;
    }
    printf("\n");
    
    printf("Power Level: ");
    switch (getPowerLevel()) {
        case NRF24_POWER_LEVEL_NEG18DBM: printf("-18dBm"); break;
        case NRF24_POWER_LEVEL_NEG12DBM: printf("-12dBm"); break;
        case NRF24_POWER_LEVEL_NEG6DBM: printf("-6dBm"); break;
        case NRF24_POWER_LEVEL_0DBM: printf("0dBm"); break;
    }
    printf("\n");
    
    printf("CRC Length: ");
    switch (getCRCLength()) {
        case NRF24_CRC_DISABLED: printf("Disabled"); break;
        case NRF24_CRC_8BIT: printf("8-bit"); break;
        case NRF24_CRC_16BIT: printf("16-bit"); break;
    }
    printf("\n");
    
    printf("Address Width: %d bytes\n", address_width);
    printf("Channel: %d (%.3f GHz)\n", channel, 2.4 + (channel * 0.001));
    printf("Payload Size: %d bytes\n", payload_size);
    printf("Auto Retransmit: %d retries, %d µs delay\n", 
           getRetryCount(), (getRetryDelay() + 1) * 250);
    
