Mounith-H/RP2040-NRF24/NRF24.cpp
    // Print addresses
    printf("\nAddresses:\n");
    printf("TX: ");
    for (int i = 0; i < address_width; i++) {
        printf("%02X ", tx_address[i]);
    }
    printf("\n");
    
    for (int i = 0; i < NRF_MAX_PIPES; i++) {
        if (rx_pipe_enabled & (1 << i)) {
            printf("RX P%d: ", i);
            for (int j = 0; j < address_width; j++) {
                printf("%02X ", pipes[i].address[j]);
            }
            printf("(Size: %d)\n", pipes[i].payload_size);
        }
    }
    
    printf("\nStatistics:\n");
    printf("Packets Sent: %d\n", packets_sent);
    printf("Packets Received: %d\n", packets_received);
    printf("Packets Lost: %d\n", packets_lost);
}

// Compatibility functions (for backward compatibility)
void NRF24::enableAck(uint8_t ack)
{
    setAutoAck(ack != 0);
}

void NRF24::config(uint8_t *address, uint8_t channel, uint8_t messageLen)
{
    this->channel = channel;
    this->messageLen = messageLen;
    
    csnHigh();
    ceLow();
    sleep_ms(11);
    
    // Basic configuration
    writeReg(NRF_CONFIG_REGISTER, NRF_CONFIG_EN_CRC | NRF_CONFIG_CRCO | NRF_CONFIG_PWR_UP);
    sleep_us(1500);
    
    // Disable auto-ack by default for compatibility
    writeReg(NRF_EN_AA_REGISTER, 0x00);
    
    // Set address width to 5 bytes
    writeReg(NRF_SETUP_AW_REGISTER, 0x03);
    
    // Set auto retransmit
    writeReg(NRF_SETUP_RETR_REGISTER, 0x00);
    
    // Set channel
    writeReg(NRF_RF_CH_REGISTER, channel);
    
    // Set RF setup (2Mbps, 0dBm)
    writeReg(NRF_RF_SETUP_REGISTER, 0x0E);
    
    // Set addresses
    writeReg(NRF_RX_ADDR_P0_REGISTER, address, 5);
    writeReg(NRF_TX_ADDR_REGISTER, address, 5);
    
    // Set payload size
    writeReg(NRF_RX_PW_P0_REGISTER, messageLen);
    
    // Update internal state
    setChannel(channel);
    setPayloadSize(messageLen);
    setAddressWidth(NRF24_ADDR_WIDTH_5BYTES);
    setTxAddress(address);
    openReadingPipe(0, address);
}

void NRF24::modeRX()
{
    setModeRX();
}

void NRF24::modeTX()
{
    setModeTX();
}

uint8_t NRF24::newMessage()
{
    return available();
}

void NRF24::sendMessage(uint8_t *data)
{
    write(data, messageLen);
}

void NRF24::getMessage(uint8_t *buffer)
{
    read(buffer, messageLen);
}

uint8_t NRF24::readRegister(uint8_t reg)
{
    return readReg(reg);
}
